app/Controllers/Alunos.php

SELECT *
FROM `alunos`
---
    public function index()
    {
        $alunos = $this->aluno_model->findAll();

SELECT *
FROM `alunos`
WHERE `id_aluno` = '79'
 LIMIT 1
---
    public function editar($id_aluno)
    {
        $aluno = $this->aluno_model->where('id_aluno', $id_aluno)->first();

SELECT *
FROM `alunos`
WHERE `id_aluno` = '1'
 LIMIT 1
---
    public function store()
    {
        $dados = $this->request->getVar();

        if (!empty($_FILES['img']['name'])) {
            // UPLOAD ARQUIVO DE IMAGEM
            $validationRule = [
                'img' => [
                    'label' => 'image',
                    'rules' => 'uploaded[img]'
                        . '|is_image[img]'
                        . '|mime_in[img,image/png]'
                        . '|max_size[img,5000]'
                        . '|max_dims[img,1024,768]',
                ],
            ];
            $name = $dados['nome'] . '-' .  rand() . '.png';

            $img = $this->request->getFile('img');

            if ($img->isValid()) {
                $img->move('./img',str_replace(' ','',$name));
            }
            $dados['foto'] = str_replace(' ','',$name);
        }

        if(isset($dados['id_aluno'])){
            // Retornado dados do usuário
            $aluno = $this->aluno_model->where('id_aluno', $dados['id_aluno'])->first();

UPDATE `alunos` SET `nome` = 'ALEF WENDERSON MELGACO GOMES', `cep` = '32606710', `logradouro` = 'Rua Divinópolis', `numero` = '22', `complemento` = '', `bairro` = 'Conjunto Habitacional Homero Gil', `estado` = 'MG', `foto` = 'ALEFWENDERSONMELGACOGOMES-724753594.png', `updated_at` = '2022-01-27 19:47:00'
WHERE `id_aluno` = '1'
INSERT INTO `alunos` (`nome`, `cep`, `logradouro`, `numero`, `complemento`, `bairro`, `estado`, `foto`, `created_at`, `updated_at`) VALUES ('Alef Wenderson Melgaço Gomes', '32280070', 'Rua Rio Comprido', '22', 'de 0509/510 a 2700/2701', 'Riacho das Pedras', 'MG', 'AlefWendersonMelgaçoGomes-1592029552.png', '2022-01-27 19:47:51', '2022-01-27 19:47:51')
---
            }

            // editando dados no banco
            $this->aluno_model->where('id_aluno', $dados['id_aluno'])->set($dados)->update();
        } else {

            // inserindo dados no banco
            $this->aluno_model->insert($dados);

SELECT *
FROM `alunos`
WHERE `id_aluno` = '1'
 LIMIT 1
---
     public function ver($id_aluno)
    {
        $aluno = $this->aluno_model->where('id_aluno', $id_aluno)->first();